In [25]:
import pandas as pd
import sklearn

df_titanic = pd.read_csv("titanic_training.csv")
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
df_titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [27]:
# pclass count values in each category
df_titanic['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [28]:
ni単os = df_titanic[df_titanic['Age'] < 18].shape[0]

(ni単os/df_titanic.shape[0])*100

12.682379349046016

In [29]:
df_sobrevivientes = df_titanic[df_titanic['Survived'] == 1]
df_sobrevivientes.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,342.000000,342.0,342.000000,290.000000,342.000000,342.000000,342.000000
mean,444.368421,1.0,1.950292,28.343690,0.473684,0.464912,48.395408
std,252.358840,0.0,0.863321,14.950952,0.708688,0.771712,66.596998
min,2.000000,1.0,1.000000,0.420000,0.000000,0.000000,0.000000
25%,250.750000,1.0,1.000000,19.000000,0.000000,0.000000,12.475000
50%,439.500000,1.0,2.000000,28.000000,0.000000,0.000000,26.000000
75%,651.500000,1.0,3.000000,36.000000,1.000000,1.000000,57.000000
max,890.000000,1.0,3.000000,80.000000,4.000000,5.000000,512.329200

In [30]:
#porcentaje clase 1
clase1 = df_sobrevivientes[df_sobrevivientes['Pclass'] == 1].shape[0]
total = df_sobrevivientes.shape[0]
print((clase1/total)*100)

#porcentaje clase 1
clase1 = df_sobrevivientes[df_sobrevivientes['Age']  < 18].shape[0]
total = df_sobrevivientes.shape[0]
print((clase1/total)*100)

39.76608187134503
17.83625730994152

In [31]:
ni単os_c1 = df_titanic[(df_titanic['Pclass'] == 3)]
#porcentaje de supervivencia de este df
ni単os_c1['Survived'].value_counts()

0    372
1    119
Name: Survived, dtype: int64

In [32]:
df_sobrevivientes.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,342.000000,342.0,342.000000,290.000000,342.000000,342.000000,342.000000
mean,444.368421,1.0,1.950292,28.343690,0.473684,0.464912,48.395408
std,252.358840,0.0,0.863321,14.950952,0.708688,0.771712,66.596998
min,2.000000,1.0,1.000000,0.420000,0.000000,0.000000,0.000000
25%,250.750000,1.0,1.000000,19.000000,0.000000,0.000000,12.475000
50%,439.500000,1.0,2.000000,28.000000,0.000000,0.000000,26.000000
75%,651.500000,1.0,3.000000,36.000000,1.000000,1.000000,57.000000
max,890.000000,1.0,3.000000,80.000000,4.000000,5.000000,512.329200

In [33]:
def clasificador_titanic(x):
    vive = False
    if x['Age'] < 18:
        vive = True
    if x['Sex'] == "female" and x['Pclass'] == 1:
        vive = True

    if x['Sex'] == "female" and  0 < x['SibSp']:
        vive = True
    
    if x['Sex'] == "male" and x['SibSp'] == 0 and x['Pclass'] == 3:
        vive = False
    
    
    
    return vive

In [41]:
def clasificador_titanic(x):
    # Define rules for survival based on combinations of Sex, Pclass, Age, and SibSp
    rules = {
        # genero, clase, edad, hermanos
        ('female', 1, True, True): True,
        ('female', 1, True, False): True,
        ('female', 1, False, True): True,
        ('female', 1, False, False): True,
        ('female', 2, True, True): True,
        ('female', 2, True, False): True,
        ('female', 2, False, True): True,
        ('female', 2, False, False): False,
        ('female', 3, True, True): True,
        ('female', 3, True, False): True,
        ('female', 3, False, True): False,
        ('female', 3, False, False): False,
        ('male', 1, True, True): True,
        ('male', 1, True, False): True,
        ('male', 1, False, True): True,
        ('male', 1, False, False): False,
        ('male', 2, True, True): False,
        ('male', 2, True, False): False,
        ('male', 2, False, True): False,
        ('male', 2, False, False): False,
        ('male', 3, True, True): False,
        ('male', 3, True, False): False,
        ('male', 3, False, True): False,
        ('male', 3, False, False): False,
    }
    
    # Determine the combination
    age_group = x['Age'] < 18
    sibsp_group = x['SibSp'] >= 1
    combination = (x['Sex'], x['Pclass'], age_group, sibsp_group)
    
    # Return the survival decision based on the rules
    return rules.get(combination, False)

# implement this function to the dataframe with a for
df_titanic['Survived_prediction'] = df_titanic.apply(clasificador_titanic, axis=1)

#test the accuracy of the model 
from sklearn.metrics import accuracy_score
restult = accuracy_score(df_titanic['Survived'], df_titanic['Survived_prediction'])
restult

0.7542087542087542

In [40]:
#import titanic competencia
df_titanic_test = pd.read_csv("titanic_competencia.csv")

#test with the new data
df_titanic_test['Survived_prediction'] = df_titanic_test.apply(clasificador_titanic, axis=1)

df_titanic_test['Survived_prediction'].head(10)

0     True
1     True
2    False
3    False
4     True
5     True
6     True
7     True
8     True
9     True
Name: Survived_prediction, dtype: bool